src/services/BookService.php

INSERT INTO "book" ("title", "article", "date_receipt", "status") VALUES ('Какая то книга', 'q73Wt1IXYhFf3OLq6OhCR_eKiduHZt', '2023-01-31 10:41:43', TRUE) RETURNING "id"
INSERT INTO "book_author" ("book_id", "author_id") VALUES (41, 41)
INSERT INTO `book_author` (`book_id`, `author_id`) VALUES (12, 3)
---
    public function createBook(Model $request):Book|array
    {
        $transaction = ActiveRecord::getDb()->beginTransaction();
        $book = new Book();
        try {

            $book = $book->setTitle($request->title)
                ->setArticle()->setDateReceipt();
            $book->save();

            if(is_array($request->author_name)){

                foreach ($request->author_name as $name){
                    $book->link('authors', $this->createOrGetAuthor($name));
                }

            }else{
                $book->link('authors', $this->createOrGetAuthor($request->author_name));

SELECT * FROM `author` WHERE `name`='Панькин'
INSERT INTO `author` (`name`) VALUES ('Панькин')
---
    private function createOrGetAuthor($name){
        $author = Author::findOne(['name' => $name]);


        if($author === null){

            $author = new Author();
            $author->name = $name;

            $author->save();