api/v1/controllers/BookController.php

    public function actionIndexBooks(){
        $books = Book::find();
        $books = (new BookSearch($_GET))->apply($books);
        $pagination = new Pagination(['totalCount' => $books->count(), 'pageSize' => 10]);
---
SELECT * FROM `book`
SELECT * FROM "book"
SELECT COUNT(*) FROM "book"