src/models/Worker.php

SELECT * FROM `worker` WHERE `auth_key`='eLJV1mpLJTCL5X3NNQ56VEAhpPQguomjg50_gNjgFfBwd8r53bKYSrNxuuxZ'
---
    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['auth_key' => $token]);

UPDATE `worker` SET `auth_key`='eLJV1mpLJTCL5X3NNQ56VEAhpPQguomjg50_gNjgFfBwd8r53bKYSrNxuuxZ' WHERE `id`=1
---
    public function getAuthKey()
    {
        $this->generateAuthKey();
        $this->save();