src/requests/LoginRequest.php

SELECT * FROM `worker` WHERE `login`='Kir4ick'
---
    public function validatePassword($attribute, $params)
    {
        if (!$this->hasErrors()) {
            $worker = Worker::findOne(['login' => $this->login]);